Autodesk.Revit.DB.ExportEnergyModelType
This enum is used to define if energy model used for gbXML export should be based on rooms/spaces or building elements.
Since:
2015

Autodesk.Revit.DB.ExportEnergyModelType.BuildingElement
The building element based energy analytical model.

Autodesk.Revit.DB.ExportEnergyModelType.SpatialElement
Energy model based on rooms or spaces.